# Задание 1

value = 10 + 5
print(value)
name = input("Напишите имя >>> ")
print(name)
number = int(input("введите число >>> "))
print(number)