# Задание 3

a = input("Введите переменную >>> ")
a2 = a + a
a3 = a + a + a
sum = int(a) + int(a2) + int(a3)
print(f"{a} + {a2} + {a3} = {sum}")